# 603. Consecutive Available Seats
[問題](https://leetcode.com/problems/consecutive-available-seats/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針

Gaps and Islandsを使う。

In [2]:
import pandas as pd

In [3]:
data = [[1, 1], [2, 0], [3, 1], [4, 1], [5, 1]]
cinema = pd.DataFrame(data, columns=['seat_id', 'free']).astype({'seat_id':'Int64', 'free':'int'})

In [4]:
cinema

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1

In [36]:
def consecutive_available_seats(cinema: pd.DataFrame) -> pd.DataFrame:
    free = cinema[~(cinema["free"] == 0)]
    free = free.sort_values(by="seat_id", ignore_index=True)
    free["diff"] = free.groupby(free["seat_id"] - free.index)["free"].transform("count")
    result = free[free["diff"] > 1]["seat_id"].reset_index()
    return result[["seat_id"]]

In [37]:
consecutive_available_seats(cinema)

   seat_id
0        3
1        4
2        5

## Test scripts

In [23]:
free = cinema[~(cinema["free"] == 0)]

In [24]:
free

   seat_id  free
0        1     1
2        3     1
3        4     1
4        5     1

In [25]:
free = free.sort_values(by="seat_id", ignore_index=True)

In [26]:
free

   seat_id  free
0        1     1
1        3     1
2        4     1
3        5     1

In [29]:
free["diff"] = free.groupby(free["seat_id"] - free.index)["seat_id"].transform("count")

In [30]:
free

   seat_id  free  diff
0        1     1     1
1        3     1     3
2        4     1     3
3        5     1     3

In [33]:
result = free[free["diff"] > 1]["seat_id"].reset_index()

In [35]:
result[["seat_id"]]

   seat_id
0        3
1        4
2        5